#include <iostream>

using namespace std;

int main() {
	int number;

	cin >> number;

	//ще интерпретираме условието като "Да се провери дали едно число е четно".
	//очакваме програмата да ни изведе 1, ако е четно и 0, иначе;

	//едно число е нечетно тстк в двоичния му запис последният му бит е 1;
	//ако приложим конюнкция (и) върху нашето число и числото 1 (0001), и получим резултат, различен от 1,
	//то значи нашето число е четно; 
	//иначе казано, с този метод проверяваме дали последният бит на числото ни е 1;
	//ако е 1, и приложим "и" с 1, трябва да получим 1; ако получим 1, значи числото ни е нечетно;
	//пр. 5 & 1 == 0101 & 0001 == 0001 == 1 => 5 е нечетно;
	//пр. 4 & 1 == 0100 & 0001 == 0000 != 1 => 4 е четно;
	cout << ((number & 1) != 1);

	return 0;
}