#include <iostream>

using namespace std;

int main() {
	int a;
	int b;
	cin >> a >> b;

	//а) едно число е нечетно тстк (Тогава и Само Тогава, Когато) остатъкът му при деление на 2 е 1.
	cout << ((a % 2 == 1) || (b % 2 == 1)) << endl;

	//б) напомняме, че точка лежи в площта, заградена от окръжност к(O,R), ако за:
	//к - окръжност; центърът ѝ е т.О(х0, у0); радиусът ѝ е R
	//и Т - точката, за която проверяваме дали е в кръга; Т има координати (х, у), е изпълнено
	//(x-x0)*(x-x0) + (y-y0)*(y-y0) <= R*R; 
	//ако е изпълнено равенство (т.е. (x-x0)*(x-x0) + (y-y0)*(y-y0) == R*R), точката е ВЪРХУ окръжността.
	cout << ((a - 0) * (a - 0) + (b - 1) * (b - 1) <= 5 * 5);
	return 0;
}