#include <iostream>

using namespace std;

int main()
{
	//всяка от константите се свързва вътрешно с числов код; можем за по-готино (знаейки на колко съответства всеки предмет и че разликата между оценките е 1)
	//да запишем в enum константите така:
	enum Subjects { CALCULUS = 2, DS, ALGEBRA, IP }; //екв. на enum Subjects { CALCULUS = 2, DS = 3, ALGEBRA = 4, IP = 5};
	double average = (double)(CALCULUS + DS + ALGEBRA + IP) / 4; //можем и да ги запишем в произволен ред и задачата пак ще работи: enum Subjects { CALCULUS = 2, ALGEBRA = 4, IP = 5, DS = 3};
	cout << average; // знаем, че кодът на всеки предмет съответства на неговата оценка => за да намерим СА на оценките е достатъчно да намерим СА на кодовете на константите;
					 // кодът на константите можем да достъпим чрез името на константата;
					 // имаме преобразуване към double на р.10, защото искаме поне единият аргумент да ни е double, за да бъде делението нецелочислено.
	return 0;
}