#include <iostream>

using namespace std;

int main()
{
	//цикълът работи на същия принцип като в зад. 5, но за да вземем само четните числа,
	//увеличаваме i с 2 на всяка стъпка, вместо с 1;
	//защо инициализираме sum с 0? ако го иниц. с всяко др. число (например с 5), вместо с 0, 
	//ще намерим сумата другото_число(5)+0+2+4+6+...+18; когато имаме сума, инициализираме винаги с 0;
	int sum = 0;
	//а)
	for (int i = 0; i < 20; i = i + 2) { //включително 0 и без 20 -> започваме от 0 и въртим до по-малко от 20
		sum = sum + i;//т.е. последната стойност на i вътре в цикъла ще ни е 18;
	}
	cout << sum;

	//б)
	for (int i = 0; i <= 20; i = i + 2) { //включително 0 и 20 -> започваме от 0 и въртим до равно на 20
		sum = sum + i;//т.е. последната стойност на i вътре в цикъла ще ни е 20;
	}
	cout << sum;

	//в)
	for (int i = 1; i < 20; i = i + 2) { //искаме нечетни числа -> ще започнем от първото нечетно, т.е. от 1;
		sum = sum + i;//тук няма значение дали включваме или не 20, защото последната стойност на i вътре
	}//в цикъла ще е 19;
	cout << sum;
	return 0;
}